src/DataProcessors/ПомощникСозданияФинансовойЦели/ПомощникСозданияФинансовойЦели.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:DataProcessor>
  <name>ПомощникСозданияФинансовойЦели</name>
</mdclass:DataProcessor>

src/AccountingRegisters/ЖурналОпераций/ЖурналОпераций.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccountingRegister>
  <name>ЖурналОпераций</name>
  <chartOfAccounts>ChartOfAccounts.РазделыУчета</chartOfAccounts>
  <correspondence>true</correspondence>
  <dimensions>
    <name>Валюта</name>
    <type>
      <types>CatalogRef.Валюты</types>
    </type>
    <balance>true</balance>
  </dimensions>
  <resources>
    <name>ВалютнаяСумма</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>14</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
    <balance>true</balance>
  </resources>
  <attributes>
    <name>Содержание</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>250</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>РазделВалютнойОперации</name>
    <type>
      <types>ChartOfAccountsRef.РазделыУчета</types>
    </type>
  </attributes>
  <attributes>
    <name>ОбъектВалютнойОперации</name>
    <type>
      <types>Characteristic.ВидыСубконто</types>
    </type>
  </attributes>
  <attributes>
    <name>СуммаВалютнойОперации</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>14</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВалютаВалютнойОперации</name>
    <type>
      <types>CatalogRef.Валюты</types>
    </type>
  </attributes>
</mdclass:AccountingRegister>

src/InformationRegisters/КурсыВалют/КурсыВалют.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>КурсыВалют</name>
  <informationRegisterPeriodicity>Day</informationRegisterPeriodicity>
  <resources>
    <name>Курс</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>4</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>Кратность</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>Валюта</name>
    <type>
      <types>CatalogRef.Валюты</types>
    </type>
  </dimensions>
  <dimensions>
    <name>БазоваяВалюта</name>
    <comment>Валюта, по отношению к которой хранится курс</comment>
    <type>
      <types>CatalogRef.Валюты</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

src/Documents/Перемещение/Перемещение.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>Перемещение</name>
  <registerRecords>AccumulationRegister.ОборотыПлановыхОпераций</registerRecords>
  <registerRecords>AccountingRegister.ЖурналОпераций</registerRecords>
  <registerRecords>AccumulationRegister.ФактическиеОборотыБюджета</registerRecords>
  <attributes>
    <name>СчетОткуда</name>
    <type>
      <types>ChartOfAccountsRef.РазделыУчета</types>
    </type>
  </attributes>
  <attributes>
    <name>ФинансоваяЦельОткуда</name>
    <type>
      <types>CatalogRef.ФинансовыеЦели</types>
    </type>
  </attributes>
  <attributes>
    <name>КошелекОткуда</name>
    <type>
      <types>CatalogRef.КошелькиИСчета</types>
    </type>
  </attributes>
  <attributes>
    <name>СчетКуда</name>
    <type>
      <types>ChartOfAccountsRef.РазделыУчета</types>
    </type>
  </attributes>
  <attributes>
    <name>ФинансоваяЦельКуда</name>
    <type>
      <types>CatalogRef.ФинансовыеЦели</types>
    </type>
  </attributes>
  <attributes>
    <name>КошелекКуда</name>
    <type>
      <types>CatalogRef.КошелькиИСчета</types>
    </type>
  </attributes>
  <attributes>
    <name>СуммаОперации</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>РасходыИзКошелькаСписания</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>РасходыИзКошелькаПоступления</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВалютаОперации</name>
    <type>
      <types>CatalogRef.Валюты</types>
    </type>
  </attributes>
  <attributes>
    <name>Пользователь</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ОписаниеОперации</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ЭтоШаблон</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>СписаноСУчетомРасходов</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПолученоСУчетомРасходов</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <tabularSections>
    <name>АналитикаДокумента</name>
    <comment>Аналитика, использованная в документе</comment>
    <attributes>
      <name>ВидАналитики</name>
      <type>
        <types>ChartOfCharacteristicTypesRef.ВидыАналитик</types>
      </type>
    </attributes>
    <attributes>
      <name>РедактироватьВШапке</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>ЗначениеАналитикиВШапке</name>
      <type>
        <types>Characteristic.ВидыАналитик</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ДополнительныеРасходы</name>
    <attributes>
      <name>КошелекРасхода</name>
      <type>
        <types>CatalogRef.КошелькиИСчета</types>
      </type>
    </attributes>
    <attributes>
      <name>СтатьяРасхода</name>
      <type>
        <types>CatalogRef.СтатьиРасходов</types>
      </type>
    </attributes>
    <attributes>
      <name>СуммаРасхода</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ФинансоваяЦель</name>
      <type>
        <types>CatalogRef.ФинансовыеЦели</types>
      </type>
    </attributes>
    <attributes>
      <name>АналитикаСтатьи</name>
      <type>
        <types>CatalogRef.ЗначенияСубконтоАналитика</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ДополнительныеРеквизиты</name>
    <attributes>
      <name>Свойство</name>
      <type>
        <types>ChartOfCharacteristicTypesRef.ДополнительныеРеквизитыИСведения</types>
      </type>
    </attributes>
    <attributes>
      <name>Значение</name>
      <type>
        <types>Characteristic.ДополнительныеРеквизитыИСведения</types>
      </type>
    </attributes>
    <attributes>
      <name>ТекстоваяСтрока</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

src/Catalogs/ФинансовыеЦели/ФинансовыеЦели.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>ФинансовыеЦели</name>
  <predefined>
    <items>
      <name>ОбщиеНакопления</name>
      <description>Общие накопления (без указания цели)</description>
    </items>
  </predefined>
  <attributes>
    <name>Активность</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>РеквизитДопУпорядочивания</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>5</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СостояниеФинансовойЦели</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Сумма</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Валюта</name>
    <type>
      <types>CatalogRef.Валюты</types>
    </type>
  </attributes>
  <attributes>
    <name>Срок</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ШаблонНакопления</name>
    <type>
      <types>DocumentRef.Доход</types>
      <types>DocumentRef.Перемещение</types>
    </type>
  </attributes>
  <tabularSections>
    <name>ДополнительныеРеквизиты</name>
    <attributes>
      <name>Свойство</name>
      <type>
        <types>ChartOfCharacteristicTypesRef.ДополнительныеРеквизитыИСведения</types>
      </type>
    </attributes>
    <attributes>
      <name>Значение</name>
      <type>
        <types>Characteristic.ДополнительныеРеквизитыИСведения</types>
      </type>
    </attributes>
    <attributes>
      <name>ТекстоваяСтрока</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

src/DataProcessors/ПомощникСозданияФинансовойЦели/Forms/Форма/Module.bsl
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ПодготовитьФормуНаСервере();
	
КонецПроцедуры

&НаКлиенте
Процедура ПередЗаписью(Отказ, ПараметрыЗаписи)
	ОбслуживаниеСправочниковКлиент.ИнформироватьОДобавленииСтатьиБюджета();
КонецПроцедуры
 
&НаКлиенте
Процедура ПослеЗаписи(ПараметрыЗаписи)
	
	Оповестить("Записан элемент справочника", Новый Структура("ИмяСправочника,Ссылка", "ФинансовыеЦели", ФинансоваяЦель.Ссылка));
	
КонецПроцедуры

&НаСервере
Процедура ПослеЗаписиНаСервере(ТекущийОбъект, ПараметрыЗаписи)
	
	#Область ПрикрепленныеФайлы
	ПрикрепленныеФайлыСервер.ОбработатьИЗаписатьДанныеМультимедиа(МедиаФайлы, ТекущийОбъект.Ссылка);
	#КонецОбласти 
	
	Если ЗначениеЗаполнено(ФинансоваяЦель.Ссылка) И ТаблицаКошельков.Итог("Отложить") <> 0 Тогда
		
		ВалютаУчета = Константы.ВалютаУчета.Получить();
		
		Для Каждого СтрокаКошелька Из ТаблицаКошельков Цикл
			
			Если СтрокаКошелька.Отложить = 0 Тогда
				Продолжить;
			КонецЕсли;
			
			ДокументНакопления = Документы.Перемещение.СоздатьДокумент();
			ДокументНакопления.Дата                  = ТекущаяДатаСеанса();
			ДокументНакопления.СчетОткуда            = ПланыСчетов.РазделыУчета.Накопления;
			ДокументНакопления.СчетКуда              = ПланыСчетов.РазделыУчета.Накопления;
			ДокументНакопления.КошелекОткуда         = СтрокаКошелька.Кошелек;
			ДокументНакопления.КошелекКуда           = СтрокаКошелька.Кошелек;
			ДокументНакопления.ФинансоваяЦельОткуда  = Справочники.ФинансовыеЦели.ОбщиеНакопления;
			ДокументНакопления.ФинансоваяЦельКуда    = ФинансоваяЦель.Ссылка;
			ДокументНакопления.СуммаОперации         = СтрокаКошелька.Отложить;
			ДокументНакопления.ВалютаОперации        = СтрокаКошелька.Отложить;
			
			ДокументНакопления.Комментарий           = "Первоначальные накопления";
			
			ДокументНакопления.Записать(РежимЗаписиДокумента.Проведение, РежимПроведенияДокумента.Неоперативный);
			
		КонецЦикла; 
		
	КонецЕсли; 
	
	Элементы.ГруппаСтраницыПомощника.ТекущаяСтраница = Элементы.ГруппаФинансоваяЦель;
	УправлениеФормой(ЭтаФорма);
	
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
	
	#Область ПрикрепленныеФайлы
	Если (ПрикрепленныеФайлыКлиент.ЭтоПрикреплениеФайла(ЭтотОбъект, ИмяСобытия, Источник))Тогда
		ПрикрепленныеФайлыКлиент.ОбработатьОповещениеДобавленияФайла(ЭтотОбъект, Параметр);
	ИначеЕсли (ПрикрепленныеФайлыКлиент.ЭтоИзменениеСпискаМультимедиа(ЭтотОбъект, ИмяСобытия, Источник))Тогда
		ПрикрепленныеФайлыКлиентСервер.ОбновитьПредставлениеТекущегоФайла(ЭтотОбъект);
	КонецЕсли;
	#КонецОбласти
	
КонецПроцедуры



#КонецОбласти


#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура ТаблицаКошельковПриИзменении(Элемент)
	
	ТекстИтогаНакоплений = ПолучитьТекстИтогов(ТаблицаКошельков);
	Элементы.ТекстИтогаНакоплений.Высота = СтрЧислоСтрок(ТекстИтогаНакоплений) + 1; 
	
КонецПроцедуры

&НаКлиенте
Процедура ВалютаПриИзменении(Элемент)
	
	ВалютаПриИзмененииСервер();
	
КонецПроцедуры

&НаКлиенте
Процедура КомментарийНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	ОбщегоНазначенияКлиент.ПоказатьФормуРедактированияКомментария(Элемент.ТекстРедактирования, ЭтотОбъект, "ФинансоваяЦель.Комментарий", Заголовок);
	
КонецПроцедуры

&НаКлиенте
Процедура ТаблицаКошельковОтложитьПриИзменении(Элемент)
	
	СтрокаКошелька = Элементы.ТаблицаКошельков.ТекущиеДанные;
	СтрокаКошелька.ОтложитьВВалютеЦели = РаботаСКурсамиВалютКлиентСервер.ПересчитатьИзВалютыВВалюту(СтрокаКошелька.Отложить,
			СтрокаКошелька.Валюта, ФинансоваяЦель.Валюта, СтрокаКошелька.КурсКошелька, КурсЦели, 
			СтрокаКошелька.КратностьКошелька, КратностьЦели);
	
КонецПроцедуры


#Область ПрикрепленныеФайлы

&НаКлиенте
Процедура ПредставлениеТекущегоФайлаНажатие(Элемент, СтандартнаяОбработка)
	ПрикрепленныеФайлыКлиент.ОбработчикНажатияНаТекущийФайл(ЭтотОбъект, Элемент, СтандартнаяОбработка);
КонецПроцедуры

&НаКлиенте
Процедура ФайлКнопкаНавигацииНажатие(Элемент)
	ПрикрепленныеФайлыКлиент.ФайлКнопкаНавигацииНажатие(ЭтотОбъект, Элемент);
КонецПроцедуры

#КонецОбласти 



#КонецОбласти


#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ПеренестиВсе(Команда)
	
	Для каждого Строка Из ТаблицаКошельков Цикл
		Строка.Отложить = Строка.Остаток;
	КонецЦикла;
	ТекстИтогаНакоплений = ПолучитьТекстИтогов(ТаблицаКошельков);
	Элементы.ТекстИтогаНакоплений.Высота = СтрЧислоСтрок(ТекстИтогаНакоплений) + 1; 
	
КонецПроцедуры

&НаКлиенте
Процедура ОчиститьВсе(Команда)
	
	Для каждого Строка Из ТаблицаКошельков Цикл
		Строка.Отложить = 0;
	КонецЦикла;
	ТекстИтогаНакоплений = ПолучитьТекстИтогов(ТаблицаКошельков);
	Элементы.ТекстИтогаНакоплений.Высота = СтрЧислоСтрок(ТекстИтогаНакоплений) + 1; 
	
КонецПроцедуры

&НаКлиенте
Процедура ПредыдущаяСтраница(Команда)
	
	ПоказатьСтраницу(ЭтаФорма, -1);
	
КонецПроцедуры

&НаКлиенте
Процедура СледующаяСтраница(Команда)
	
	ПоказатьСтраницу(ЭтаФорма, 1);
	
КонецПроцедуры



#КонецОбласти


#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура ПодготовитьФормуНаСервере()
	
	#Область ПрикрепленныеФайлы
	ПрикрепленныеФайлыКлиентСервер.ОбновитьПредставлениеТекущегоФайла(ЭтотОбъект);
	#КонецОбласти	
	
	// Подготовка редактируемых объектов
	Если Параметры.Копирование И ЗначениеЗаполнено(Параметры.ОбъектКопирования) Тогда
		ФинансоваяЦель.Наименование = "Копия: " + Параметры.ОбъектКопирования.Наименование;
		ФинансоваяЦель.Валюта = Параметры.ОбъектКопирования.Валюта;
		ФинансоваяЦель.Сумма  = Параметры.ОбъектКопирования.Сумма;
		ФинансоваяЦель.Срок   = Параметры.ОбъектКопирования.Срок;
		КурсИКратность = РаботаСКурсамиВалют.ПолучитьКурсВалюты(ФинансоваяЦель.Валюта);
		КурсЦели 	   = КурсИКратность.Курс;
		КратностьЦели  = КурсИКратность.Кратность;
	Иначе
		ФинансоваяЦель.Валюта = Константы.ВалютаУчета.Получить();
		КурсЦели = 1;
		КратностьЦели = 1;
	КонецЕсли; 
	ФинансоваяЦель.Активность = Истина;
	
	// Заполнение дополнительных колонок
	ЗаполнитьДобавленныеКолонки();
	
	// Подготовка реквизитов формы
	Если ТаблицаКошельков.Количество() > 0 Тогда
		СписокЗаголовковНавигатора.Добавить("Шаг 1 из 2: Параметры финансовой цели");
		СписокЗаголовковНавигатора.Добавить("Шаг 2 из 2: Перенос доступных накоплений на финансовую цель");
	Иначе
		СписокЗаголовковНавигатора.Добавить("Шаг 1 из 1: Параметры финансовой цели");
	КонецЕсли; 
	
	// Настройка внешнего вида
	УправлениеФормой(ЭтаФорма);
	ПоказатьСтраницу(ЭтаФорма, 0);
	
	// Общие настройки форм элементов справочников
	РаботаСФормамиСправочников.ФормаЭлементаПриСозданииНаСервере(ЭтаФорма);
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьДобавленныеКолонки()

	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("ВалютаУчета", Константы.ВалютаУчета.Получить());
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	жОстатки.Субконто1 КАК Кошелек,
	|	жОстатки.Валюта,
	|	жОстатки.ВалютнаяСуммаОстаток КАК Остаток,
	|	КурсыКошельков.Курс КАК КурсКошелька,
	|	КурсыКошельков.Кратность КАК КратностьКошелька
	|ИЗ
	|	РегистрБухгалтерии.ЖурналОпераций.Остатки(, Счет = ЗНАЧЕНИЕ(ПланСчетов.РазделыУчета.Накопления), , Субконто2 = ЗНАЧЕНИЕ(Справочник.ФинансовыеЦели.ОбщиеНакопления)) КАК жОстатки
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.КурсыВалют.СрезПоследних(, БазоваяВалюта = &ВалютаУчета) КАК КурсыКошельков
	|		ПО жОстатки.Валюта = КурсыКошельков.Валюта
	|
	|УПОРЯДОЧИТЬ ПО
	|	жОстатки.Субконто1.Наименование";
	
	ТаблицаКошельков.Загрузить(Запрос.Выполнить().Выгрузить());

КонецПроцедуры

&НаСервереБезКонтекста
Процедура УправлениеФормой(Форма)


КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста 
Процедура ПоказатьСтраницу(Форма, Направление)

	Элементы = Форма.Элементы;
	СписокЗаголовков = Форма.СписокЗаголовковНавигатора;
	
	
	Страницы = Элементы.ГруппаСтраницыПомощника.ПодчиненныеЭлементы;
	ТекущийИндекс = Страницы.Индекс(Элементы.ГруппаСтраницыПомощника.ТекущаяСтраница);
	НовыйИндекс = ТекущийИндекс + Направление;
	Если НовыйИндекс < 0 Или НовыйИндекс > СписокЗаголовков.Количество() - 1 Тогда
		Возврат;
	КонецЕсли; 

	Элементы.ДекорацияЗаголовокНавигатора.Заголовок = СписокЗаголовков[НовыйИндекс];
	Элементы.ГруппаСтраницыПомощника.ТекущаяСтраница = Страницы[НовыйИндекс];
	Элементы.ПредыдущаяСтраница.Доступность = НовыйИндекс > 0;
	Элементы.СледующаяСтраница.Доступность = НовыйИндекс < СписокЗаголовков.Количество() - 1 И Форма.ФинансоваяЦель.Ссылка.Пустая();
	Элементы.СледующаяСтраница.КнопкаПоУмолчанию = Элементы.СледующаяСтраница.Доступность;
	Элементы.ЗаписатьИЗакрыть.КнопкаПоУмолчанию = НЕ Элементы.СледующаяСтраница.Доступность;
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция ПолучитьТекстИтогов(Знач ТаблицаКошельков)

	ТаблицаВалют = ТаблицаКошельков.Выгрузить();
	ТаблицаВалют.Свернуть("Валюта", "Отложить");
	Результат = "";
	Для Каждого СтрокаИтога Из ТаблицаВалют  Цикл
		Если СтрокаИтога.Отложить <> 0 Тогда
			Результат = Результат + ?(Результат = "", "", Символы.ПС)
				+ Формат(СтрокаИтога.Отложить, "ЧЦ=15; ЧДЦ=2") + " " + СтрокаИтога.Валюта;
		КонецЕсли; 
	КонецЦикла; 
	
	Результат = ?(Результат = "", "", "Отложено: ") + Результат;
	Возврат Результат;

КонецФункции

&НаСервере
Процедура ВалютаПриИзмененииСервер()

	КурсИКратность = РаботаСКурсамиВалют.ПолучитьКурсВалюты(ФинансоваяЦель.Валюта);
	КурсЦели 	   = КурсИКратность.Курс;
	КратностьЦели  = КурсИКратность.Кратность;
	
	Для Каждого СтрокаКошелька Из ТаблицаКошельков Цикл
		Если СтрокаКошелька.Отложить <> 0 Тогда
			СтрокаКошелька.ОтложитьВВалютеЦели = РаботаСКурсамиВалютКлиентСервер.ПересчитатьИзВалютыВВалюту(СтрокаКошелька.Отложить,
					СтрокаКошелька.Валюта, ФинансоваяЦель.Валюта, СтрокаКошелька.КурсКошелька, КурсЦели, 
					СтрокаКошелька.КратностьКошелька, КратностьЦели);
		КонецЕсли; 
	КонецЦикла; 

	
	
КонецПроцедуры



#КонецОбласти
